#+TITLE: ConfigurationForm vs PreviewField — Component Comparison
#+DATE: 2026-05-06
#+AUTHOR: Copilot
#+OPTIONS: num:nil toc:t
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [11pt,a4paper]
#+LATEX_HEADER: \PassOptionsToPackage{table,dvipsnames}{xcolor}
#+LATEX_HEADER: \usepackage[margin=2.2cm,top=2.8cm,bottom=2.8cm]{geometry}
#+LATEX_HEADER: \usepackage{xcolor}
#+LATEX_HEADER: \usepackage{lmodern}
#+LATEX_HEADER: \usepackage[scaled=0.85]{helvet}
#+LATEX_HEADER: \usepackage[scaled=0.9]{inconsolata}
#+LATEX_HEADER: \usepackage{titlesec}
#+LATEX_HEADER: \usepackage{fancyhdr}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage{tabularx}
#+LATEX_HEADER: \definecolor{PrimaryDark}{HTML}{1B2A4A}
#+LATEX_HEADER: \definecolor{AccentCyan}{HTML}{00B4D8}
#+LATEX_HEADER: \definecolor{AccentOrange}{HTML}{F77F00}
#+LATEX_HEADER: \definecolor{AccentPurple}{HTML}{7209B7}
#+LATEX_HEADER: \definecolor{EmeraldGreen}{HTML}{2D9E6B}
#+LATEX_HEADER: \definecolor{TableOdd}{HTML}{D6EFFF}
#+LATEX_HEADER: \definecolor{CodeBg}{HTML}{1E1E2E}
#+LATEX_HEADER: \definecolor{CodeKeyword}{HTML}{CBA6F7}
#+LATEX_HEADER: \definecolor{CodeString}{HTML}{A6E3A1}
#+LATEX_HEADER: \definecolor{CodeComment}{HTML}{6C7086}
#+LATEX_HEADER: \definecolor{CodeFg}{HTML}{CDD6F4}
#+LATEX_HEADER: \newcommand{\SectionRule}{\color{AccentCyan}\titlerule[2pt]}
#+LATEX_HEADER: \titleformat{\section}{\normalfont\Large\bfseries\sffamily\color{PrimaryDark}}{}{0pt}{}[\SectionRule]
#+LATEX_HEADER: \titleformat{\subsection}{\normalfont\large\bfseries\sffamily\color{AccentPurple}}{}{0pt}{}
#+LATEX_HEADER: \titleformat{\subsubsection}{\normalfont\normalsize\bfseries\sffamily\color{AccentOrange}}{}{0pt}{}
#+LATEX_HEADER: \titlespacing*{\section}{0pt}{2ex plus 0.5ex}{1ex}
#+LATEX_HEADER: \setlength{\parskip}{0.4em}
#+LATEX_HEADER: \setlength{\parindent}{0pt}
#+LATEX_HEADER: \AtBeginDocument{\rowcolors{2}{TableOdd}{white}}
* Bundle Size Analysis

Evaluate =bundle-data= with =C-c C-c= to refresh from the latest build, then
re-evaluate =bundle-overall= and =bundle-top5= to regenerate the tables.

#+NAME: bundle-data
#+begin_src sh :results output :exports none :cache yes
./scripts/stats.js --analyze --json 2>/dev/null
#+end_src

#+RESULTS[5a4e5a38fc5a8bb6d98c0d4c408c6a5932b25dcb]: bundle-data
#+begin_example
{
  "repos": [
    "mantine-v8",
    "jolly-ui",
    "shadcn-baseui"
  ],
  "summary": [
    {
      "metric": "Total (parsed)",
      "mantine-v8": 714927,
      "jolly-ui": 608813,
      "shadcn-baseui": 621005
    },
    {
      "metric": "Total (gzip)",
      "mantine-v8": 247178,
      "jolly-ui": 238352,
      "shadcn-baseui": 222603
    },
    {
      "metric": "Total (brotli)",
      "mantine-v8": 212257,
      "jolly-ui": 209005,
      "shadcn-baseui": 194885
    },
    {
      "metric": "JS (parsed)",
      "mantine-v8": 513745,
      "jolly-ui": 566321,
      "shadcn-baseui": 545535
    },
    {
      "metric": "JS (gzip)",
      "mantine-v8": 217093,
      "jolly-ui": 230702,
      "shadcn-baseui": 210259
    },
    {
      "metric": "CSS (parsed)",
      "mantine-v8": 200625,
      "jolly-ui": 42025,
      "shadcn-baseui": 75015
    },
    {
      "metric": "CSS (gzip)",
      "mantine-v8": 29737,
      "jolly-ui": 7350,
      "shadcn-baseui": 12051
    },
    {
      "metric": "node_modules",
      "mantine-v8": 498042,
      "jolly-ui": 533618,
      "shadcn-baseui": 496865
    },
    {
      "metric": "App code",
      "mantine-v8": 15703,
      "jolly-ui": 32703,
      "shadcn-baseui": 48670
    }
  ],
  "top5": {
    "mantine-v8": [
      [
        "@mantine",
        200735
      ],
      [
        "react-dom",
        178512
      ],
      [
        "@dnd-kit",
        44194
      ],
      [
        "@floating-ui",
        26413
      ],
      [
        "react-number-format/dist/react-number-format.es.js",
        15003
      ]
    ],
    "jolly-ui": [
      [
        "react-dom",
        180333
      ],
      [
        "react-aria/dist/private",
        144603
      ],
      [
        "react-virtuoso/dist/index.mjs",
        54277
      ],
      [
        "@dnd-kit",
        46537
      ],
      [
        "react-aria-components/dist/private",
        35475
      ]
    ],
    "shadcn-baseui": [
      [
        "react-dom",
        178660
      ],
      [
        "@base-ui",
        139162
      ],
      [
        "react-virtuoso/dist/index.mjs",
        59321
      ],
      [
        "@dnd-kit",
        48307
      ],
      [
        "tailwind-merge/dist/bundle-mjs.mjs",
        26229
      ]
    ]
  }
}
#+end_example

** Overall bundle sizes

#+NAME: bundle-overall
#+begin_src emacs-lisp :var json=bundle-data :results value table :exports results
(require 'json)
(let* ((json-object-type 'alist)
       (json-array-type  'list)
       (json-key-type    'string)
       (data    (json-read-from-string json))
       (repos   (cdr (assoc "repos" data)))
       (summary (cdr (assoc "summary" data)))
       (to-kb   (lambda (b) (format "%.1f KB" (/ (float b) 1024.0))))
       (headers (cons "Metric" repos))
       (rows    (mapcar (lambda (row)
                          (cons (cdr (assoc "metric" row))
                                (mapcar (lambda (r)
                                          (funcall to-kb (cdr (assoc r row))))
                                        repos)))
                        summary)))
  (append (list headers 'hline) rows))
#+end_src

#+RESULTS: bundle-overall
| Metric         | mantine-v8 | jolly-ui | shadcn-baseui |
|----------------+------------+----------+---------------|
| Total (parsed) | 698.2 KB   | 594.5 KB | 606.5 KB      |
| Total (gzip)   | 241.4 KB   | 232.8 KB | 217.4 KB      |
| Total (brotli) | 207.3 KB   | 204.1 KB | 190.3 KB      |
| JS (parsed)    | 501.7 KB   | 553.0 KB | 532.7 KB      |
| JS (gzip)      | 212.0 KB   | 225.3 KB | 205.3 KB      |
| CSS (parsed)   | 195.9 KB   | 41.0 KB  | 73.3 KB       |
| CSS (gzip)     | 29.0 KB    | 7.2 KB   | 11.8 KB       |
| node_modules   | 486.4 KB   | 521.1 KB | 485.2 KB      |
| App code       | 15.3 KB    | 31.9 KB  | 47.5 KB       |

